Repository: kesanchezgo/my_ebook_reader_anki_app
Catalog: lib/l10n/app_*.arb
Languages: es, pt

# libraryTitle
source: My Library
es: Mi Biblioteca
pt: Minha Biblioteca

source: My Vocabulary
es: Mi Vocabulario
pt: Meu Vocabulário

source: Settings
es: Configuración
pt: Configurações

# bookImported
source: Book "{title}" imported
es: Libro "{title}" importado
pt: Livro "{title}" importado

# libraryEmptyTitle
source: Your library is empty
es: Tu biblioteca está vacía
pt: Sua biblioteca está vazia

# libraryEmptySubtitle
source: Import your EPUB books to start reading and creating vocabulary cards.
es: Importa tus libros EPUB para empezar a leer y crear tarjetas de vocabulario.
pt: Importe seus livros EPUB para começar a ler e criar cartões de vocabulário.

# importEpubTooltip
source: Import book (EPUB)
es: Importar libro (EPUB)
pt: Importar livro (EPUB)

# deleteBookTitle
source: Delete book
es: Eliminar libro
pt: Excluir livro

# deleteBookContent
source: Are you sure you want to delete "{title}"?
es: ¿Estás seguro de que quieres eliminar "{title}"?
pt: Tem certeza de que deseja excluir "{title}"?

# deleteReadingData
source: Also delete reading data
es: Eliminar también datos de lectura
pt: Excluir também dados de leitura

source: Cancel
es: Cancelar
pt: Cancelar

source: Delete
es: Eliminar
pt: Excluir

source: Book deleted
es: Libro eliminado
pt: Livro excluído

source: APPEARANCE
es: APARIENCIA
pt: APARÊNCIA

# appLanguageTitle
source: App Language
es: Idioma de la Aplicación
pt: Idioma do Aplicativo

# appLanguageSubtitle
source: Select the interface language.
es: Selecciona el idioma de la interfaz.
pt: Selecione o idioma da interface.

# themeTitle
source: App Theme
es: Tema de la aplicación
pt: Tema do aplicativo

# themeSubtitle
source: Select your preferred color scheme for the interface.
es: Selecciona el esquema de colores que prefieras para la interfaz.
pt: Selecione o esquema de cores de sua preferência.

source: AI SERVICES
es: SERVICIOS DE IA
pt: SERVIÇOS DE IA

source: API Credentials
es: Credenciales de API
pt: Credenciais da API

# apiCredentialsSubtitle
source: Configure your keys to enable AI features in dictionary and explanations.
es: Configura tus claves para habilitar las funciones de IA en el diccionario y explicaciones.
pt: Configure suas chaves para habilitar recursos de IA no dicionário e explicações.

# apiKeyHint
source: Paste your API Key here
es: Pega tu API Key aquí
pt: Cole sua chave de API aqui

source: SMART DICTIONARY
es: DICCIONARIO INTELIGENTE
pt: DICIONÁRIO INTELIGENTE

source: Definition Priority
es: Prioridad de Definición
pt: Prioridade de Definição

# definitionPrioritySubtitle
source: Drag to reorder which sources to consult first when looking up a word.
es: Arrastra para reordenar qué fuentes consultar primero al buscar una palabra.
pt: Arraste para reordenar quais fontes consultar primeiro ao buscar uma palavra.

source: CONTEXT EXPLANATION
es: EXPLICACIÓN DE CONTEXTO
pt: EXPLICAÇÃO DE CONTEXTO

source: Explanation Priority
es: Prioridad de Explicación
pt: Prioridade de Explicação

# explanationPrioritySubtitle
source: Drag to reorder which AI to consult first when analyzing context.
es: Arrastra para reordenar qué IA consultar primero al analizar el contexto.
pt: Arraste para reordenar qual IA consultar primeiro ao analisar o contexto.

source: INFORMATION
es: INFORMACIÓN
pt: INFORMAÇÕES

source: Version
es: Versión
pt: Versão

source: Developer
es: Desarrollador
pt: Desenvolvedor

source: Active
es: Activo
pt: Ativo

# localDictionary
source: Local Dictionary (Offline)
es: Diccionario Local (Offline)
pt: Dicionário Local (Offline)

# purposeModalTitle
source: Configure Reading
es: Configura tu Lectura
pt: Configure sua Leitura

# purposeModalSubtitle
source: To provide the best experience, we need to know how you plan to read this book.
es: Para ofrecerte la mejor experiencia, necesitamos saber cómo planeas leer este libro.
pt: Para oferecer a melhor experiência, precisamos saber como você planeja ler este livro.

source: Reading Mode
es: Modo de Lectura
pt: Modo de Leitura

# readOnlyMode
source: Read Only
es: Solo Lectura
pt: Apenas Leitura

# readOnlyModeDesc
source: Enjoy the book without study tools.
es: Disfrutar del libro sin herramientas de estudio.
pt: Aproveite o livro sem ferramentas de estudo.

# nativeMode
source: Improve Vocabulary
es: Mejorar Vocabulario
pt: Melhorar Vocabulário

# nativeModeDesc
source: Look up definitions and synonyms in the same language.
es: Buscar definiciones y sinónimos en el mismo idioma.
pt: Buscar definições e sinônimos no mesmo idioma.

# studyMode
source: Learn Language
es: Aprender Idioma
pt: Aprender Idioma

# studyModeDesc
source: Translate words and phrases to your native language.
es: Traducir palabras y frases a tu idioma nativo.
pt: Traduzir palavras e frases para seu idioma nativo.

# targetLanguage
source: Translation Language
es: Idioma de Traducción
pt: Idioma de Tradução

# targetLanguageDesc
source: Definitions and explanations will be shown in this language.
es: Las definiciones y explicaciones se mostrarán en este idioma.
pt: Definições e explicações serão mostradas neste idioma.

source: Start Reading
es: Comenzar Lectura
pt: Começar Leitura

source: Recommended
es: Recomendado
pt: Recomendado

# detectedLanguage
source: Detected language: {language}
es: Idioma detectado: {language}
pt: Idioma detectado: {language}

# errorLoadingBook
source: Error loading book: {error}
es: Error cargando libro: {error}
pt: Erro ao carregar livro: {error}

# errorLoadingContent
source: Could not load book content.
es: No se pudo cargar el contenido del libro.
pt: Não foi possível carregar o conteúdo do livro.

# chapterProgress
source: Chapter {current} of {total} • {percent}%
es: Capítulo {current} de {total} • {percent}%
pt: Capítulo {current} de {total} • {percent}%

# selectWordFirst
source: Select a word first
es: Selecciona una palabra primero
pt: Selecione uma palavra primeiro

source: Restore
es: Restaurar
pt: Restaurar

source: Text Size
es: Tamaño de texto
pt: Tamanho do texto

source: Typography
es: Tipografía
pt: Tipografia

source: Alignment
es: Alineación
pt: Alinhamento

source: Justified
es: Justificado
pt: Justificado

source: Left
es: Izquierda
pt: Esquerda

source: Confirm Context
es: Confirmar Oración
pt: Confirmar Contexto

source: SAVE CARD
es: GUARDAR TARJETA
pt: SALVAR CARTÃO

source: Loading chapter...
es: Cargando capítulo...
pt: Carregando capítulo...

source: Selecting context
es: Seleccionando contexto
pt: Selecionando contexto

# selectContextInstruction
source: Select text and tap "Confirm Context"
es: Selecciona el texto y pulsa "Confirmar Oración"
pt: Selecione o texto e toque em "Confirmar Contexto"

# footnoteDevelopment
source: Footnote: Navigation in development
es: Nota al pie: Navegación en desarrollo
pt: Nota de rodapé: Navegação em desenvolvimento

source: No cards to export
es: No hay tarjetas para exportar
pt: Não há cartões para exportar

source: Exporting cards...
es: Exportando tarjetas...
pt: Exportando cartões...

# cardsExported
source: ✓ {count} cards exported
es: ✓ {count} tarjetas exportadas
pt: ✓ {count} cartões exportados

# exportError
source: Error exporting: {error}
es: Error al exportar: {error}
pt: Erro ao exportar: {error}

source: Delete card
es: Eliminar tarjeta
pt: Excluir cartão

# deleteCardConfirmation
source: Delete "{word}"?
es: ¿Eliminar "{word}"?
pt: Excluir "{word}"?

source: Card deleted
es: Tarjeta eliminada
pt: Cartão excluído

# explanationError
source: Could not get explanation. Check your connection.
es: No se pudo obtener la explicación. Verifica tu conexión.
pt: Não foi possível obter a explicação. Verifique sua conexão.

source: Connection error
es: Error de conexión
pt: Erro de conexão

source: Context Analysis
es: Análisis de Contexto
pt: Análise de Contexto

# source
source: Source: {source}
es: Fuente: {source}
pt: Fonte: {source}

source: Close
es: Cerrar
pt: Fechar

source: ORIGINAL CONTEXT
es: Oración del libro
pt: CONTEXTO ORIGINAL

source: Main Idea
es: Idea Principal
pt: Ideia Principal

source: KEY VOCABULARY
es: VOCABULARIO CLAVE
pt: VOCABULÁRIO CHAVE

source: Usage Examples
es: Ejemplos de Uso
pt: Exemplos de Uso

source: CULTURAL NOTE
es: NOTA CULTURAL
pt: NOTA CULTURAL

source: Dictionaries
es: Diccionarios
pt: Dicionários

source: Export to CSV
es: Exportar a CSV
pt: Exportar para CSV

source: Search words...
es: Buscar palabras...
pt: Buscar palavras...

source: Cards
es: Tarjetas
pt: Cartões

source: Books
es: Libros
pt: Livros

source: With audio
es: Con audio
pt: Com áudio

source: No cards saved
es: No hay tarjetas guardadas
pt: Nenhum cartão salvo

source: No results found
es: No se encontraron resultados
pt: Nenhum resultado encontrado

# vocabularyEmptyState
source: Select text in your books to create cards and review vocabulary.
es: Selecciona texto en tus libros para crear tarjetas y repasar vocabulario.
pt: Selecione texto em seus livros para criar cartões e revisar vocabulário.

source: Play word
es: Reproducir palabra
pt: Reproduzir palavra

source: Definition
es: Definición
pt: Definição

source: Example
es: Ejemplo
pt: Exemplo

source: Context
es: Contexto
pt: Contexto

source: Explain with AI
es: Explicar con IA
pt: Explicar com IA

# listenContext
source: Listen to context
es: Escuchar contexto
pt: Ouvir contexto

source: Today
es: Hoy
pt: Hoje

source: Yesterday
es: Ayer
pt: Ontem

# daysAgo
source: {days} days ago
es: Hace {days} días
pt: Há {days} dias

source: Definition not found
es: Definición no encontrada
pt: Definição não encontrada

source: Search error
es: Error en la búsqueda
pt: Erro na busca

source: Saved to Study
es: Guardado en Estudio
pt: Salvo para Estudo

source: Create Study Card
es: Nueva Tarjeta
pt: Criar Cartão de Estudo

# wordAlreadyExists
source: This word is already in your collection.
es: Esta palabra ya está en tu colección.
pt: Esta palavra já está na sua coleção.

source: Word
es: Palabra
pt: Palavra

source: Example (Optional)
es: Ejemplo (Opcional)
pt: Exemplo (Opcional)

source: Select from book
es: Seleccionar del libro
pt: Selecionar do livro

# dictionarySettingsTitle
source: Dictionary Settings
es: Configuración de Diccionarios
pt: Configurações de Dicionários

source: Dictionary Language
es: Idioma del diccionario
pt: Idioma do dicionário

# dictionaryLanguageQuestion
source: What language are the definitions in?
es: ¿En qué idioma están las definiciones?
pt: Em que idioma estão as definições?

# englishLanguage
source: 🇬🇧 English (EN)
es: 🇬🇧 Inglés (EN)
pt: 🇬🇧 Inglês (EN)

# spanishLanguage
source: 🇪🇸 Spanish (ES)
es: 🇪🇸 Español (ES)
pt: 🇪🇸 Espanhol (ES)

source: Importing dictionary...
es: Importando diccionario...
pt: Importando dicionário...

# importedWordsCount
source: Imported {count} words
es: Importadas {count} palabras
pt: Importadas {count} palavras

# importError
source: Error importing dictionary
es: Error al importar diccionario
pt: Erro ao importar dicionário

# invalidJsonError
source: The file is not a valid JSON
es: El archivo no es un JSON válido
pt: O arquivo não é um JSON válido

# invalidJsonArrayError
source: Incorrect format: JSON array expected
es: Formato incorrecto: se esperaba un array JSON
pt: Formato incorreto: esperava-se um array JSON

source: Clear Dictionary
es: Limpiar diccionario
pt: Limpar Dicionário

# clearDictionaryConfirmation
source: Are you sure? All saved words will be deleted.
es: ¿Estás seguro? Se eliminarán todas las palabras guardadas.
pt: Tem certeza? Todas as palavras salvas serão excluídas.

source: Dictionary cleared
es: Diccionario limpiado
pt: Dicionário limpo

source: How it works
es: Cómo funciona
pt: Como funciona

# howItWorksDescription
source: 1. Local dictionary is checked first (fast, offline) 2. If word not found, searches online 3. Words found online are saved locally
es: 1. El diccionario local se consulta primero (rápido, offline) 2. Si no encuentra la palabra, busca online 3. Las palabras encontradas online se guardan localmente
pt: 1. O dicionário local é consultado primeiro (rápido, offline) 2. Se não encontrar, busca online 3. Palavras encontradas online são salvas localmente

source: Statistics
es: Estadísticas
pt: Estatísticas

source: 🇪🇸 Spanish Dictionary
es: 🇪🇸 Diccionario Español
pt: 🇪🇸 Dicionário Espanhol

source: 🇬🇧 English Dictionary
es: 🇬🇧 Diccionario English
pt: 🇬🇧 Dicionário Inglês

source: Total stored
es: Total almacenado
pt: Total armazenado

source: Disk size
es: Tamaño en disco
pt: Tamanho em disco

source: Actions
es: Acciones
pt: Ações

source: Import Dictionary
es: Importar diccionario
pt: Importar dicionário

# jsonFormat
source: Monolingual JSON format
es: Formato JSON monolingüe
pt: Formato JSON monolíngue

source: Dictionary Format
es: Formato de diccionario
pt: Formato de dicionário

# supportedFormats
source: Supported formats: • SpanishBFF: ("id", "lemma", "definition") • Standard: ("word", "definition", "examples") • Alternative: ("term", "meaning") Note: Monolingual dictionaries only (word and definition in the same language)
es: Formatos soportados: • SpanishBFF: ("id", "lemma", "definition") • Estándar: ("word", "definition", "examples") • Alternativo: ("term", "meaning") Nota: Diccionarios monolingües solamente (palabra y definición en el mismo idioma)
pt: Formatos suportados: • SpanishBFF: ("id", "lemma", "definition") • Padrão: ("word", "definition", "examples") • Alternativo: ("term", "meaning") Nota: Apenas dicionários monolíngues (palavra e definição no mesmo idioma)

source: Unknown Author
es: Autor Desconocido
pt: Autor Desconhecido

# appTitle
source: My Reader
es: Mi Lector
pt: Meu Leitor

# langSpanish
source: 🇪🇸 Spanish
es: 🇪🇸 Español
pt: 🇪🇸 Espanhol

# langEnglish
source: 🇺🇸 English
es: 🇺🇸 Inglés
pt: 🇺🇸 Inglês

# langFrench
source: 🇫🇷 French
es: 🇫🇷 Francés
pt: 🇫🇷 Francês

# langGerman
source: 🇩🇪 German
es: 🇩🇪 Alemán
pt: 🇩🇪 Alemão

# langItalian
source: 🇮🇹 Italian
es: 🇮🇹 Italiano
pt: 🇮🇹 Italiano

# langPortuguese
source: 🇧🇷 Portuguese
es: 🇧🇷 Portugués
pt: 🇧🇷 Português

# readerToolCapture
source: Capture Card
es: Crear Tarjeta

# readerToolAnalyze
source: Analyze Text
es: Analizar Texto

# readerToolSynonyms
source: See Synonyms
es: Ver Sinónimos

# promptSelectWord
source: Select the word to learn
es: Elige la palabra a estudiar

# promptSelectContext
source: Now select the context
es: Selecciona la oración para: {word}

# promptSelectText
source: Select text to analyze
es: Selecciona el texto a analizar

# actionConfirmWord
source: Confirm Word
es: Confirmar Palabra

# actionConfirmContext
source: Confirm Context
es: Confirmar Oración

# actionAnalyze
source: Analyze
es: Analizar

# actionSynonyms
source: Find Synonyms
es: Buscar Sinónimos

# analyzingContext
source: Analyzing context with AI...
es: Analizando contexto con IA...
pt: Analisando contexto com IA...

# errorGeneric
source: Error: {error}
pt: Erro: {error}
